app/Traits/TrafficTrait.php

    public function addTraffic($no_halaman)
    {
        // Membuat instance model TrafficModel
        $trafficModel = new TrafficModel();

        // Menyiapkan data yang akan dimasukkan ke tabel
        $data = [
            'no_halaman' => $no_halaman,
        ];

        // Menambahkan data ke tabel traffic
        $trafficModel->insert($data);
---
INSERT INTO `traffic` (`no_halaman`, `created_at`, `updated_at`) VALUES (1, '2024-12-21 08:54:19', '2024-12-21 08:54:19')